; domain
(define (domain parking)
 (:requirements :strips :typing :action-costs)
 (:types car curb)
 (:predicates 
    (at-curb ?car - car) 
    (at-curb-num ?car - car ?curb - curb)
    (behind-car ?car ?front-car - car)
    (car-clear ?car - car) 
    (curb-clear ?curb - curb)
 )


	(:action move-curb-to-curb
		:parameters (?car - car ?curbsrc ?curbdest - curb)
		:precondition (and 
			(car-clear ?car)
			(curb-clear ?curbdest)
			(at-curb-num ?car ?curbsrc)
		)
		:effect (and 
			(not (curb-clear ?curbdest))
			(curb-clear ?curbsrc)
			(at-curb-num ?car ?curbdest)
			(not (at-curb-num ?car ?curbsrc))
                        (increase (total-cost) 1)
		)
	)

	(:action move-curb-to-car
		:parameters (?car - car ?curbsrc - curb ?cardest - car)
		:precondition (and 
			(car-clear ?car)
			(car-clear ?cardest)
			(at-curb-num ?car ?curbsrc)
			(at-curb ?cardest) 
		)
		:effect (and 
			(not (car-clear ?cardest))
			(curb-clear ?curbsrc)
			(behind-car ?car ?cardest)
			(not (at-curb-num ?car ?curbsrc))
			(not (at-curb ?car))
                        (increase (total-cost) 1)
		)
	)

	(:action move-car-to-curb
		:parameters (?car - car ?carsrc - car ?curbdest - curb)
		:precondition (and 
			(car-clear ?car)
			(curb-clear ?curbdest)
			(behind-car ?car ?carsrc)
		)
		:effect (and 
			(not (curb-clear ?curbdest))
			(car-clear ?carsrc)
			(at-curb-num ?car ?curbdest)
			(not (behind-car ?car ?carsrc))
			(at-curb ?car)
                        (increase (total-cost) 1)
		)
	)

	(:action move-car-to-car
		:parameters (?car - car ?carsrc - car ?cardest - car)
		:precondition (and 
			(car-clear ?car)
			(car-clear ?cardest)
			(behind-car ?car ?carsrc)
			(at-curb ?cardest) 
		)
		:effect (and 
			(not (car-clear ?cardest))
			(car-clear ?carsrc)
			(behind-car ?car ?cardest)
			(not (behind-car ?car ?carsrc))
                        (increase (total-cost) 1)
		)
	)
)

; problem
(define   (problem parking)
  (:domain parking)
  (:objects
     car_00  car_01  car_02  car_03  car_04  car_05  car_06  car_07  car_08  car_09  car_10  car_11  car_12  car_13 - car
     curb_00 curb_01 curb_02 curb_03 curb_04 curb_05 curb_06 curb_07 curb_08 curb_09 curb_10 curb_11 curb_12 curb_13 curb_14 curb_15 curb_16 curb_17 curb_18 curb_19 curb_20 curb_21 curb_22 curb_23 - curb
  )
  (:init
    (at-curb car_09)
    (at-curb-num car_09 curb_00)
    (behind-car car_02 car_09)
    (car-clear car_02)
    (at-curb car_10)
    (at-curb-num car_10 curb_01)
    (behind-car car_04 car_10)
    (car-clear car_04)
    (at-curb car_06)
    (at-curb-num car_06 curb_02)
    (behind-car car_08 car_06)
    (car-clear car_08)
    (at-curb car_05)
    (at-curb-num car_05 curb_03)
    (car-clear car_05)
    (at-curb car_12)
    (at-curb-num car_12 curb_04)
    (car-clear car_12)
    (at-curb car_11)
    (at-curb-num car_11 curb_05)
    (car-clear car_11)
    (at-curb car_00)
    (at-curb-num car_00 curb_06)
    (car-clear car_00)
    (at-curb car_01)
    (at-curb-num car_01 curb_07)
    (car-clear car_01)
    (at-curb car_03)
    (at-curb-num car_03 curb_08)
    (car-clear car_03)
    (at-curb car_13)
    (at-curb-num car_13 curb_09)
    (car-clear car_13)
    (at-curb car_07)
    (at-curb-num car_07 curb_10)
    (car-clear car_07)
    (curb-clear curb_11)
    (curb-clear curb_12)
    (curb-clear curb_13)
    (curb-clear curb_14)
    (curb-clear curb_15)
    (curb-clear curb_16)
    (curb-clear curb_17)
    (curb-clear curb_18)
    (curb-clear curb_19)
    (curb-clear curb_20)
    (curb-clear curb_21)
    (curb-clear curb_22)
    (curb-clear curb_23)
  )
  (:goal
    (and
      (at-curb-num car_00 curb_00)
      (at-curb-num car_01 curb_01)
      (at-curb-num car_02 curb_02)
      (at-curb-num car_03 curb_03)
      (at-curb-num car_04 curb_04)
      (at-curb-num car_05 curb_05)
      (at-curb-num car_06 curb_06)
      (at-curb-num car_07 curb_07)
      (at-curb-num car_08 curb_08)
      (at-curb-num car_09 curb_09)
      (at-curb-num car_10 curb_10)
      (at-curb-num car_11 curb_11)
      (at-curb-num car_12 curb_12)
      (at-curb-num car_13 curb_13)
    )
  )

)
; =========== INIT =========== 
;  curb_00: car_09 car_02 
;  curb_01: car_10 car_04 
;  curb_02: car_06 car_08 
;  curb_03: car_05 
;  curb_04: car_12 
;  curb_05: car_11 
;  curb_06: car_00 
;  curb_07: car_01 
;  curb_08: car_03 
;  curb_09: car_13 
;  curb_10: car_07 
;  curb_11: 
;  curb_12: 
;  curb_13: 
;  curb_14: 
;  curb_15: 
;  curb_16: 
;  curb_17: 
;  curb_18: 
;  curb_19: 
;  curb_20: 
;  curb_21: 
;  curb_22: 
;  curb_23: 
; ========== /INIT =========== 

; =========== GOAL =========== 
;  curb_00: car_00 
;  curb_01: car_01 
;  curb_02: car_02 
;  curb_03: car_03 
;  curb_04: car_04 
;  curb_05: car_05 
;  curb_06: car_06 
;  curb_07: car_07 
;  curb_08: car_08 
;  curb_09: car_09 
;  curb_10: car_10 
;  curb_11: car_11 
;  curb_12: car_12 
;  curb_13: car_13 
;  curb_14: 
;  curb_15: 
;  curb_16: 
;  curb_17: 
;  curb_18: 
;  curb_19: 
;  curb_20: 
;  curb_21: 
;  curb_22: 
;  curb_23: 
; =========== /GOAL ===========

; plan
1. (move-curb-to-curb car_05 curb_03 curb_15)
   deleted: (curb-clear curb_15) (at-curb-num car_05 curb_03)
   added: (curb-clear curb_03) (at-curb-num car_05 curb_15)
   goals met: 0 of 14
2. (move-car-to-curb car_04 car_10 curb_20)
   deleted: (curb-clear curb_20) (behind-car car_04 car_10)
   added: (car-clear car_10) (at-curb-num car_04 curb_20) (at-curb car_04)
   goals met: 0 of 14
3. (move-curb-to-curb car_10 curb_01 curb_22)
   deleted: (curb-clear curb_22) (at-curb-num car_10 curb_01)
   added: (curb-clear curb_01) (at-curb-num car_10 curb_22)
   goals met: 0 of 14
4. (move-curb-to-curb car_13 curb_09 curb_01)
   deleted: (curb-clear curb_01) (at-curb-num car_13 curb_09)
   added: (curb-clear curb_09) (at-curb-num car_13 curb_01)
   goals met: 0 of 14
5. (move-car-to-curb car_02 car_09 curb_21)
   deleted: (curb-clear curb_21) (behind-car car_02 car_09)
   added: (car-clear car_09) (at-curb-num car_02 curb_21) (at-curb car_02)
   goals met: 0 of 14
6. (move-curb-to-curb car_09 curb_00 curb_19)
   deleted: (curb-clear curb_19) (at-curb-num car_09 curb_00)
   added: (curb-clear curb_00) (at-curb-num car_09 curb_19)
   goals met: 0 of 14
7. (move-curb-to-curb car_00 curb_06 curb_00)
   deleted: (curb-clear curb_00) (at-curb-num car_00 curb_06)
   added: (curb-clear curb_06) (at-curb-num car_00 curb_00)
   goals met: 1 of 14
8. (move-curb-to-curb car_11 curb_05 curb_17)
   deleted: (curb-clear curb_17) (at-curb-num car_11 curb_05)
   added: (curb-clear curb_05) (at-curb-num car_11 curb_17)
   goals met: 1 of 14
9. (move-curb-to-curb car_11 curb_17 curb_11)
   deleted: (curb-clear curb_11) (at-curb-num car_11 curb_17)
   added: (curb-clear curb_17) (at-curb-num car_11 curb_11)
   goals met: 2 of 14
10. (move-curb-to-car car_13 curb_01 car_11)
   deleted: (car-clear car_11) (at-curb-num car_13 curb_01) (at-curb car_13)
   added: (curb-clear curb_01) (behind-car car_13 car_11)
   goals met: 2 of 14
11. (move-curb-to-curb car_05 curb_15 curb_05)
   deleted: (curb-clear curb_05) (at-curb-num car_05 curb_15)
   added: (curb-clear curb_15) (at-curb-num car_05 curb_05)
   goals met: 3 of 14
12. (move-curb-to-curb car_01 curb_07 curb_01)
   deleted: (curb-clear curb_01) (at-curb-num car_01 curb_07)
   added: (curb-clear curb_07) (at-curb-num car_01 curb_01)
   goals met: 4 of 14
13. (move-curb-to-car car_07 curb_10 car_04)
   deleted: (car-clear car_04) (at-curb-num car_07 curb_10) (at-curb car_07)
   added: (curb-clear curb_10) (behind-car car_07 car_04)
   goals met: 4 of 14
14. (move-curb-to-curb car_10 curb_22 curb_10)
   deleted: (curb-clear curb_10) (at-curb-num car_10 curb_22)
   added: (curb-clear curb_22) (at-curb-num car_10 curb_10)
   goals met: 5 of 14
15. (move-car-to-curb car_13 car_11 curb_13)
   deleted: (curb-clear curb_13) (behind-car car_13 car_11)
   added: (car-clear car_11) (at-curb-num car_13 curb_13) (at-curb car_13)
   goals met: 6 of 14
16. (move-curb-to-curb car_12 curb_04 curb_12)
   deleted: (curb-clear curb_12) (at-curb-num car_12 curb_04)
   added: (curb-clear curb_04) (at-curb-num car_12 curb_12)
   goals met: 7 of 14
17. (move-car-to-curb car_07 car_04 curb_07)
   deleted: (curb-clear curb_07) (behind-car car_07 car_04)
   added: (car-clear car_04) (at-curb-num car_07 curb_07) (at-curb car_07)
   goals met: 8 of 14
18. (move-curb-to-curb car_04 curb_20 curb_04)
   deleted: (curb-clear curb_04) (at-curb-num car_04 curb_20)
   added: (curb-clear curb_20) (at-curb-num car_04 curb_04)
   goals met: 9 of 14
19. (move-curb-to-curb car_03 curb_08 curb_03)
   deleted: (curb-clear curb_03) (at-curb-num car_03 curb_08)
   added: (curb-clear curb_08) (at-curb-num car_03 curb_03)
   goals met: 10 of 14
20. (move-car-to-car car_08 car_06 car_04)
   deleted: (car-clear car_04) (behind-car car_08 car_06)
   added: (car-clear car_06) (behind-car car_08 car_04)
   goals met: 10 of 14
21. (move-curb-to-curb car_06 curb_02 curb_06)
   deleted: (curb-clear curb_06) (at-curb-num car_06 curb_02)
   added: (curb-clear curb_02) (at-curb-num car_06 curb_06)
   goals met: 11 of 14
22. (move-curb-to-curb car_02 curb_21 curb_02)
   deleted: (curb-clear curb_02) (at-curb-num car_02 curb_21)
   added: (curb-clear curb_21) (at-curb-num car_02 curb_02)
   goals met: 12 of 14
23. (move-curb-to-curb car_09 curb_19 curb_09)
   deleted: (curb-clear curb_09) (at-curb-num car_09 curb_19)
   added: (curb-clear curb_19) (at-curb-num car_09 curb_09)
   goals met: 13 of 14
24. (move-car-to-curb car_08 car_04 curb_08)
   deleted: (curb-clear curb_08) (behind-car car_08 car_04)
   added: (car-clear car_04) (at-curb-num car_08 curb_08) (at-curb car_08)
   goals met: 14 of 14
